rapport.tex
% Created 2015-11-14 Sat 11:42
\documentclass[11pt, oneside]{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{hyperref}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage[scaled=0.9]{zi4}
\usepackage[usenames, dvipsnames]{xcolor}
\usepackage[protrusion=true, expansion=alltext, tracking=true, kerning=true]{microtype}
\usepackage{siunitx}
\input{header.tex}
\author{Samuel Barreto}
\date{\today}
\title{La conversion génique vers GC : processus majeur d'évolution des génomes}
\hypersetup{
 pdfauthor={Samuel Barreto},
 pdftitle={La conversion génique vers GC : processus majeur d'évolution des génomes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.2)}, 
 pdflang={English}}
\begin{document}

\input{frontmatter.tex}

\section*{Introduction}
\label{sec:orgheadline1}
La recombinaison homologue est un processus majeur d'évolution des génomes.
C'est un processus très conservé, des procaryotes aux eucaryotes\cite{cromie_recombination_2001}. C'est le
processus clé de réparation des lésions de l'ADN. Elles sont réparées sur la
base d'une matrice d'ADN homologue, donnant lieu à la formation transitoire d'un
\emph{hétéroduplex}. Un hétéroduplex est un appariement entre deux brins homologues,
qui ne sont pas nécessairement rigoureusement complémentaires. Chez les
eucaryotes, la matrice est typiquement la région homologue correspondante, sur
le chromosome sœur. Les crossing-over méiotiques sont générés sous contrôle
génétique et impliquent une étape obligatoire de recombinaison\cite{mancera_high-resolution_2008}. Chez les
procaryotes, cette matrice peut être acquise par transfert horizontal. La
recombinaison est le moyen principal de transfert de gène entre les bactéries\cite{vos_rates_2015}.

\newthought{Au voisinage} de la région lésée --- puis réparée --- , des échanges
d'information génétique de petite échelle existent\cite{duret_biased_2009}. Ils
sont dûs à la correction des erreurs d'appariement dans l'hétéroduplex. Ce sont
des événements de \emph{conversion génique}. Ils donnent lieu à des transmissions
non-mendéliennes d'allèles : l'information génétique est transmise d'un brin
vers l'autre, de façon unidirectionnelle. Cette conversion est \emph{biaisée} dès
lors que l'un des allèles a une plus forte probabilité de transmission, à
l'échelle de la population. Chez les eucaryotes, de nombreuses observations
existent, qui montrent que la conversion est biaisée \emph{vers G ou
C}\cite{pessia_evidence_2012, mancera_high-resolution_2008}. Les allèles G ou C
sont plus souvent transmis que les allèles A ou T. Ce biais de conversion
génique en faveur de GC --- \ac{gbgc} --- a un impact fort sur l'évolution des
génomes : il conditionne la \emph{structuration} en contenu GC des génomes ; il peut
\emph{interférer} avec la sélection naturelle ; et, d'un point de vue pratique, il
peut \emph{brouiller les tests} de sélection naturelle\cite{duret_biased_2009}.

Dans les régions fortement recombinantes, le contenu en GC est anormalement
élevé, lorsque le biais est observé\cite{duret_impact_2008}. Ce mécanisme permet
d'expliquer partiellement les variations en \ac{gc}, au sein d'un génome et
entre génomes. Il existe un débat dans la communauté scientifique entre les
partisans des hypothèses adaptatives, et ceux des hypothèses neutres. Les
hypothèses \emph{adaptatives} veulent que le contenu en GC soit un trait
sélectionné : il contribue en soi à la valeur adaptative de
l'individu\cite{hildebrand_evidence_2010}. Les hypothèses \emph{neutres} avancent
qu'il est également déterminé par des processus de dérive génétique et de
mutation. Le \ac{gbgc} est un autre processus neutre contribuant à déterminer le
\ac{gc}. En fait, c'est la contribution \emph{relative} des trois processus à la
détermination du \ac{gc} qui fait débat.

Le biais peut également permettre de fixer des mutations délétères, si celles-ci
sont portées par les allèles G ou C du gène. Il contrecarre l'action de la
sélection naturelle\cite{galtier_gc-biased_2009, galtier_adaptation_2007}.

Enfin, l'action du biais laisse des traces génomiques équivalentes à celles de
la sélection naturelle : les tests classiques de détection confondent l'action
de la sélection avec celle du \ac{gbgc}\cite{ratnakumar_detecting_2010}.

\addfig{%
  \centering
  \missingfigure
  \caption{\textbf{Succession des étapes de recombinaison homologue}}
  \label{recomb}
}

\newthought{Récemment,} l'hypothèse du biais vers GC s'est étendue aux
procaryotes. Des observations montrent que les régions fortement recombinantes
ont un contenu en GC significativement plus élevé. L'extension de cette
hypothèse aux procaryotes représente une avancée majeure : elle pourrait
permettre d'expliquer l'évolution du contenu en GC des populations bactériennes.

Nous verrons donc, dans une première partie, ce qu'est la conversion génique
biaisée et les mécanismes qui la sous-tendent ; dans une deuxième, ses
conséquences évolutives ; et dans une dernière, les hypothèses permettant
d'expliquer son existence.

\section{Qu'est-ce que la conversion génique ?}
\label{sec:orgheadline8}

La conversion génique est un mécanisme qui intervient au cours de la réparation
de l'ADN. Lors d'une cassure double brin --- \ac{dsb} --- , la lésion est réparée par
recombinaison homologue. Les mésappariemments induits peuvent être corrigés,
donnant lieu à une transmission d'allèle non-mendélienne \cite{chen_mechanism_2008}. 

\subsection{Recombinaison homologue}
\label{sec:orgheadline6}

La réplication de l'ADN est une étape clé du cycle cellulaire. Elle implique la
formation de fourches de réplications. Les lésions subies par l'ADN en cours de
réplication empêchent le déplacement de ces fourches, et notamment les cassures
double brins. Ces \ac{dsb} sont extrêmement cytotoxiques : ils causent l'arrêt
de la réplication, la perte de chromosomes, sont mutagènes et conduisent à la
mort cellulaire\cite{watson_molecular_2014}. La bonne conduite de la réplication
nécessite de réparer ces cassures, de façon non-mutagène. La recombinaison
homologue est le moyen préférentiel de réparation \cite{lusetti_bacterial_2002}.
Compte tenu de son importance dans le cycle cellulaire, les mécanismes qui la
sous-tendent sont ubiquitaires et extrêmement conservés, des phages aux
mammifères \cite{cromie_recombination_2001}.

\subsubsection{Mécanismes de recombinaison homologue}
\label{sec:orgheadline3}

La recombinaison se déroule en plusieurs étapes. Après la formation des
\ac{dsb}, les extrémités \(5'\) de la lésion subissent une \emph{résection}, délétion
locale d'une section d'ADN. 

Les brins aux extrémités \(3'\) \emph{envahissent} les brins complémentaires de la
molécule intacte. Ces extrémités recherchent activement les zones d'homologie.
Lorsqu'une zone est déterminée, les brins sont échangés. L'ensemble de ce
processus est catalysé par la nucléo-protéine RecA\cite{chen_mechanism_2008}.
C'est l'acteur moléculaire clé de la recombinaison homologue.

L'échange des brins entraîne la formation d'un un hétéroduplex. L'intégrité de
l'hétéroduplex est maintenue par deux structures appelées \emph{jonctions de
Holliday}. Des mésappariemments peuvent exister entre les brins de
l'hétéroduplex : deux brins homologues ne sont pas systématiquement
complémentaires. Une fois résolus, ces mésappariemments peuvent être le lieu
d'une conversion génique, dont je reparlerai au paragraphe \ref{sec:orgheadline2}.

La zone de résection est ensuite comblée par la \emph{synthèse} d'ADN en utilisant le
brin homologue comme matrice.

Enfin, les intermédiaires de recombinaisons sont \emph{résolus}, par le clivage
aléatoire des jonctions de Holliday. Ce clivage est catalysée par des
résolvases, telles que RuvC\cite{gorecka_crystal_2013}. La résolution peut
donner des produits dits crossovers ou non-crossover, entraînant respectivement
l'échange des brins ou leur dissolution\cite{mancera_high-resolution_2008}.

\begin{quote}
{\em 
  La réparation des cassures est la fonction principale et \emph{première} de la
  machinerie de recombinaison homologue. Cependant, les mécanismes en jeu sont le
  lieu d'un brassage génétique, aussi bien lors de la méiose eucaryote que lors
  des transferts de gène procaryotes \cite{redfield_bacteria_2001}.
}
\end{quote}

\subsubsection{La recombinaison : étape clé de la méiose eucaryote}
\label{sec:orgheadline4}

La méiose eucaryote implique la formation de DSB sous contrôle
génétique rigoureux, qui sont réparés par recombinaison homologue
\cite{chapman_playing_2012}. Les crossovers induits permettent la bonne conduite
de la disjonction des chromosomes. Ces crossovers entraînent le brassage des
allèles, un processus bénéfique sur le plan évolutif\cite{webster_direct_2012}.
En effet, il casse les liaisons entre allèles : la sélection élimine alors plus
efficacement les variants délétères et promeut les variants bénéfiques
\cite{otto_resolving_2002}. C'est l'une des hypothèses permettant d'expliquer
l'évolution de la reproduction sexuée\cite{otto_why_2006}.

\subsubsection{La recombinaison comme moteur des transferts horizontaux de gènes}
\label{sec:orgheadline5}
Chez les procaryotes, la recombinaison est un processus plus rare.
Cependant, étant donné la taille des populations bactériennes et les temps
évolutifs en jeu, elle a également un impact majeur sur l'évolution
procaryote\cite{didelot_impact_2010}. C'est le moteur des transferts de gène.
Ceux-ci sont médiés, soit par des vecteurs, les plasmides ou les phages, soit
par un état de compétence naturelle.

\subsection{Conversion génique}
\label{sec:orgheadline2}

\subsection{La conversion génique biaisée vers GC}
\label{sec:orgheadline7}
\section{Quelles en sont les conséquences ?}
\label{sec:orgheadline12}
\subsection{Structure le contenu en GC}
\label{sec:orgheadline9}
\subsection{Interfère avec la sélection}
\label{sec:orgheadline10}
\subsection{Brouille les tests de sélection}
\label{sec:orgheadline11}
\section{Quelles hypothèses pour l'expliquer ?}
\label{sec:orgheadline15}
\subsection{Des propriétés inhérentes à la machinerie de réparation ?}
\label{sec:orgheadline13}
\subsection{Un processus sélectionné pour compenser la mutation ?}
\label{sec:orgheadline14}
\section*{Conclusion}
\label{sec:orgheadline16}
\input{endmatter.tex}
\end{document}